# 문제 내용

1. dvd렌탈 업체의 dvd 대여가 있었던 날짜를 확인해주세요.
2. 영화 카테고리 중에서 Sci-Fi 카테고리의 카테고리 번호는 몇번인가요?
3. film 테이블을 활용하여, rating 등급에 대해서 몇개의 등급이 있는지 확인해주세요.
4. 대여 기간이 (회수 - 대여일로 구할 수 있다.) 10일 이상이었던 rental 테이블에 대한 모든 정보를 알려주세요.
    - 단, 대여기간은 대여일자로부터 대여기간으로 포함하여 계산합니다.
5. 고객의 id가 50, 100, 150... 등 50번 배수에 해당하는 고객들에 대해 감사이벤트를 진행하고자 합니다.
    - 고객 아이디가 50번 배수인 아이디와, 고객의 이름 (성, 이름) 과 이메일을 확인해주세요.
6. city 테이블의 city 갯수는 몇개인가요?
7. 영화배우 이름 (이름+' '+성)에 대해서 대문자로 이름을출력해주세요.
    - 단, 고객의 이름이 동일한 사람이 있다면 중복을 제거하고 알려주세요.
    
8. film테이블을 이용해서, rental_duration이 7일 이상 대여가 가능한 film에 대해서 film_id, title, description 컬럼을 확인해주세요.
9. Actor테이블을 활용해서, 이름이 Nick이거나 성이 Hunt인 배우의 id와 이름, 성을 확인해주세요.

In [1]:
%load_ext sql

# put a folder and DB credential files at HOME directory

import os
homedir = os.getcwd()
cred_path = os.path.join(homedir, 'db_cred')



# add a 'cred_path' for interpreter to search
import sys
sys.path.append(cred_path)



# import DB credentials from 'gpdb_credentials.py' dictionary file.
from gpdb_credentials import dvdrental_db



# parsing DB credentials and connect to Greenplum using %sql $connection_string

username = dvdrental_db['Username']
password = dvdrental_db['Password']
host = dvdrental_db['Host']
port = dvdrental_db['Port']
database = dvdrental_db['Database']

connection_string = 'postgresql://{user}:{password}@{host}:{port}/{db}'.format(
user=username,
password=password,
host=host,
port=port,
db=database)

%sql $connection_string

'Connected: myuser@dvdrental'

## 1. dvd렌탈 업체의 dvd 대여가 있었던 날짜를 확인해주세요.

```python
select
	rental_date
from
	rental;
```
으로 작성할 경우 rental_date가 `시/분/초를 포함`하고 있어서 한 날짜에 여러개의 데이터가 중복 출력된다.

- 따라서 문제대로 결과값을 출력하려면 rental_date의 중복값을 조건으로 제거해 줘야 한다.
- 날짜 데이터의 경우 컬럼 앞에 date(컬럼)이란 기능을 통해 처리가 가능하다.

In [2]:
%%sql

select
	distinct date(rental_date)
from
	rental;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
41 rows affected.

[(datetime.date(2005, 5, 31),),
 (datetime.date(2005, 7, 31),),
 (datetime.date(2005, 7, 8),),
 (datetime.date(2005, 7, 26),),
 (datetime.date(2005, 8, 20),),
 (datetime.date(2005, 6, 17),),
 (datetime.date(2005, 8, 1),),
 (datetime.date(2005, 8, 18),),
 (datetime.date(2005, 5, 30),),
 (datetime.date(2005, 7, 5),),
 (datetime.date(2005, 5, 28),),
 (datetime.date(2005, 5, 26),),
 (datetime.date(2005, 8, 16),),
 (datetime.date(2005, 5, 24),),
 (datetime.date(2005, 6, 14),),
 (datetime.date(2005, 7, 9),),
 (datetime.date(2005, 8, 2),),
 (datetime.date(2005, 8, 19),),
 (datetime.date(2005, 6, 19),),
 (datetime.date(2005, 8, 21),),
 (datetime.date(2005, 8, 22),),
 (datetime.date(2005, 6, 18),),
 (datetime.date(2005, 5, 25),),
 (datetime.date(2005, 7, 11),),
 (datetime.date(2005, 6, 16),),
 (datetime.date(2005, 8, 23),),
 (datetime.date(2005, 7, 7),),
 (datetime.date(2005, 7, 12),),
 (datetime.date(2005, 5, 27),),
 (datetime.date(2005, 7, 6),),
 (datetime.date(2005, 6, 21),),
 (datetime.date(2005, 8, 17),),
 (datetime.date(2005, 7, 28),),
 (datetime.date(2005, 7, 30),),
 (datetime.date(2005, 7, 27),),
 (datetime.date(2005, 7, 10),),
 (datetime.date(2005, 6, 20),),
 (datetime.date(2005, 5, 29),),
 (datetime.date(2005, 6, 15),),
 (datetime.date(2006, 2, 14),),
 (datetime.date(2005, 7, 29),)]

## 2. 영화 카테고리 중에서 Sci-Fi 카테고리의 카테고리 번호는 몇번인가요?

- 먼저 category 카테고리에서 Sci-Fi라는 카테고리 명이 어떤 컬럼에 있는지 확인

In [3]:
%%sql

select *
	from category;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
16 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (11, 'Horror', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (12, 'Music', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (13, 'New', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (14, 'Sci-Fi', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (15, 'Sports', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (16, 'Travel', datetime.datetime(2006, 2, 15, 9, 46, 27))]

In [4]:
%%sql

select 
	category_id
from category
where name ='Sci-Fi';

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(14,)]

## 3. film 테이블을 활용하여, rating 등급에 대해서 몇개의 등급이 있는지 확인해주세요.
---
- 데이터의 개수를 세는 함수는 count()이다.
- 하지만 rating 컬럼에 있는 값들에는 중복이 존재한다. -> distinct사용해야 함
    - 중복제거를 먼저 해주어야 원하는 결과값이 나온다.

In [5]:
%%sql

select
	count(distinct rating) as rating
from
	film;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(5,)]

## 4. 대여 기간이 (회수 - 대여일로 구할 수 있다.) 10일 이상이었던 rental 테이블에 대한 모든 정보를 알려주세요.
    - 단, 대여기간은 대여일자로부터 대여기간으로 포함하여 계산합니다.
    
---

- date(return_date) - date(rental_date) 를 하면 산술적인 값이 나온다.
- 하지만 24일에 빌려서 28일에 반납을 했다면 대여기간은 24 ,25, 26, 27, 28일로 총 5일이 된다.
- 따라서 +1을 붙여 줘야 한다.

In [6]:
%%sql

select
	*,
	date(return_date) - date(rental_date)+ 1 as rental_date
from
	rental
where
	date(return_date) - date(rental_date)+ 1 >= 10
    limit 10; -- 파일크기가 너무 커서 10개만 추출

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 11),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (15, datetime.datetime(2005, 5, 25, 0, 39, 22), 3049, 319, datetime.datetime(2005, 6, 3, 3, 30, 22), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (64, datetime.datetime(2005, 5, 25, 9, 21, 29), 79, 368, datetime.datetime(2005, 6, 3, 11, 31, 29), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (75, datetime.datetime(2005, 5, 25, 11, 13, 34), 3393, 510, datetime.datetime(2005, 6, 3, 12, 58, 34), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (76, datetime.datetime(2005, 5, 25, 11, 30, 37), 3021, 1, datetime.datetime(2005, 6, 3, 12, 0, 37), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (79, datetime.datetime(2005, 5, 25, 12, 11, 7), 3299, 245, datetime.datetime(2005, 6, 3, 10, 54, 7), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (93, datetime.datetime(2005, 5, 25, 15, 54, 16), 4360, 288, datetime.datetime(2005, 6, 3, 20, 18, 16), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (103, datetime.datetime(2005, 5, 25, 17, 30, 42), 3343, 384, datetime.datetime(2005, 6, 3, 22, 36, 42), 1, datetime.datetime(2006, 2, 16, 2, 30, 53), 10),
 (106, datetime.datetime(2005, 5, 25, 18, 18, 19), 3627, 196, datetime.datetime(2005, 6, 4, 0, 1, 19), 2, datetime.datetime(2006, 2, 16, 2, 30, 53), 11)]

## 5. 고객의 id가 50, 100, 150... 등 50번 배수에 해당하는 고객들에 대해 감사이벤트를 진행하고자 합니다.
    - 고객 아이디가 50번 배수인 아이디와, 고객의 이름 (성, 이름) 과 이메일을 확인해주세요.

- 50번 배수의 아이디를 조건으로 출력하는 것 -> 아이디번호를 50으로 나누었을때 결과가 0인 것 -> mod()함수 활용
    - mod(나눌 대상, 나눌 단위)
- 고객의 일음을 (성, 이름) 형태로 출력하기 -> '||' (concat) 개념 활용

In [7]:
%%sql

select
	customer_id
	first_name,
	last_name,
	last_name || ', ' || first_name as fullname,
	email,
	mod(customer_id, 50) as mod_50
from
	customer
where
	mod(customer_id, 50) = 0;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
11 rows affected.

[(50, 'Collins', 'Collins, Diane', 'diane.collins@sakilacustomer.org', 0),
 (100, 'Hayes', 'Hayes, Robin', 'robin.hayes@sakilacustomer.org', 0),
 (150, 'Daniels', 'Daniels, Danielle', 'danielle.daniels@sakilacustomer.org', 0),
 (200, 'Lawson', 'Lawson, Jeanne', 'jeanne.lawson@sakilacustomer.org', 0),
 (250, 'Fowler', 'Fowler, Jo', 'jo.fowler@sakilacustomer.org', 0),
 (300, 'Farnsworth', 'Farnsworth, John', 'john.farnsworth@sakilacustomer.org', 0),
 (350, 'Fraley', 'Fraley, Juan', 'juan.fraley@sakilacustomer.org', 0),
 (400, 'Hardison', 'Hardison, Bryan', 'bryan.hardison@sakilacustomer.org', 0),
 (450, 'Robb', 'Robb, Jay', 'jay.robb@sakilacustomer.org', 0),
 (500, 'Kinder', 'Kinder, Reginald', 'reginald.kinder@sakilacustomer.org', 0),
 (550, 'Brownlee', 'Brownlee, Guy', 'guy.brownlee@sakilacustomer.org', 0)]

## 6. city 테이블의 city 갯수는 몇개인가요?

- 전체 데이터를 살펴보았을때, city 하나당 city_id가 할당 되어 있는 것 같다는 예상.
- 따라서 city_id 의 맨 마지막 값을 desc로 order by해서 보면 개수를 간접적으로 확인 가능할 것이다.

In [8]:
%%sql

--방법 1
select *
	from city c 
	order by city_id desc
    limit 10; -- 파일크기가 너무 커서 10개만 추출

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(600, 'Ziguinchor', 83, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (599, 'Zhoushan', 23, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (598, 'Zhezqazghan', 51, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (597, 'Zeleznogorsk', 80, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (596, 'Zaria', 69, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (595, 'Zapopan', 60, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (594, 'Zaoyang', 23, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (593, 'Zanzibar', 93, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (592, 'Zalantun', 23, datetime.datetime(2006, 2, 15, 9, 45, 25)),
 (591, 'Yuzhou', 23, datetime.datetime(2006, 2, 15, 9, 45, 25))]

- 방법 1과 동일한 전제 (city 당 city_id1개)
- max()함수를 활용하여 city_id의 max(가장 큰값)을 확인

In [9]:
%%sql
--방법 2
select max(city_id)
	from city;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(600,)]

- 가장 안전한 방법
- 데이터의 누락이 있을 수도, 중복이 있을 수도 있음
- 이를 distinct 와 count로 해결 가능

In [10]:

%%sql
--방법 3 (혹시 모를 중복값에 대한 대비 -> 가장 정확함)
select count(distinct city)
	from city;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(599,)]

## 7. 영화배우 이름 (이름+' '+성)에 대해서 대문자로 이름을 출력해주세요.
    - 단, 고객의 이름이 동일한 사람이 있다면 중복을 제거하고 알려주세요.
    
- 이름의 중복을 제거한다. -> DISTINCT
- 2개의 이름을 합친다. -> ||활용
- 이름을 대문자로 한다 -> UPPER()

In [11]:
%%sql

select 
	distinct upper(first_name || ' ' || last_name) as actor_name
from
	actor
    limit 10; -- 파일크기가 너무 커서 10개만 추출

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[('BETTE NICHOLSON',),
 ('FRED COSTNER',),
 ('MORGAN MCDORMAND',),
 ('RIVER DEAN',),
 ('RALPH CRUZ',),
 ('WILLIAM HACKMAN',),
 ('MATTHEW CARREY',),
 ('MILLA PECK',),
 ('CUBA ALLEN',),
 ('NICK DEGENERES',)]

- LOWER() 함수로 소문자로 변경할 수도 있다.

In [12]:
%%sql

select 
	distinct lower(first_name || ' ' || last_name) as actor_name
from
	actor
    limit 10; -- 파일크기가 너무 커서 10개만 추출

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[('ed guiness',),
 ('rip winslet',),
 ('salma nolte',),
 ('humphrey willis',),
 ('val bolger',),
 ('alec wayne',),
 ('russell close',),
 ('albert nolte',),
 ('natalie hopkins',),
 ('cameron streep',)]

## 8. film테이블을 이용해서, rental_duration이 7일 이상 대여가 가능한 film에 대해서 film_id, title, description 컬럼을 확인해주세요.

In [13]:
%%sql

select
	film_id,
	title,
	description
from
	film
where
	rental_duration >= 7
    limit 10; -- 파일크기가 너무 커서 10개만 추출

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria'),
 (3, 'Adaptation Holes', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory'),
 (27, 'Anonymous Human', 'A Amazing Reflection of a Database Administrator And a Astronaut who must Outrace a Database Administrator in A Shark Tank'),
 (36, 'Argonauts Town', 'A Emotional Epistle of a Forensic Psychologist And a Butler who must Challenge a Waitress in An Abandoned Mine Shaft'),
 (70, 'Bikini Borrowers', 'A Astounding Drama of a Astronaut And a Cat who must Discover a Woman in The First Manned Space Station'),
 (78, 'Blackout Private', 'A Intrepid Yarn of a Pastry Chef And a Mad Scientist who must Challenge a Secret Agent in Ancient Japan'),
 (80, 'Blanket Beverly', 'A Emotional Documentary of a Student And a Girl who must Build a Boat in Nigeria'),
 (84, 'Boiled Dares', 'A Awe-Inspiring Story of a Waitress And a Dog who must Discover a Dentist in Ancient Japan'),
 (87, 'Boondock Ballroom', 'A Fateful Panorama of a Crocodile And a Boy who must Defeat a Monkey in The Gulf of Mexico'),
 (88, 'Born Spinal', 'A Touching Epistle of a Frisbee And a Husband who must Pursue a Student in Nigeria')]

## 9. Actor테이블을 활용해서, 이름이 Nick이거나 성이 Hunt인 배우의 id와 이름, 성을 확인해주세요.

In [14]:
%%sql

select
	first_name,
	last_name,
	actor_id
from
	actor
where
	first_name = 'Nick'
	or last_name = 'Hunt'

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
4 rows affected.

[('Nick', 'Wahlberg', 2),
 ('Nick', 'Stallone', 44),
 ('Carmen', 'Hunt', 52),
 ('Nick', 'Degeneres', 166)]